# Pandas

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels=['w','x','y','z']
sample_list=[100,200,300,400]
array=np.array([1,2,3,4])
dict={'w':10,'x':20,'y':30,'z':40}

In [5]:
pd.Series(data=sample_list)

0    100
1    200
2    300
3    400
dtype: int64

In [6]:
pd.Series(data=sample_list,index=array)

1    100
2    200
3    300
4    400
dtype: int64

In [7]:
pd.Series(array,labels)

w    1
x    2
y    3
z    4
dtype: int32

In [8]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

# pandas dataframe and indexing

In [9]:
sports1=pd.Series([1,2,3,4],index=['cricket','football','basketball','golf'])
sports1

cricket       1
football      2
basketball    3
golf          4
dtype: int64

In [11]:
sports1['football']

2

In [12]:
sports2=pd.Series([11,2,3,4],index=['cricket','football','basketball','golf'])
sports2

cricket       11
football       2
basketball     3
golf           4
dtype: int64

In [13]:
sports1+sports2

cricket       12
football       4
basketball     6
golf           8
dtype: int64

In [14]:
import pandas as pd
import numpy as np

In [16]:
df1=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A  0.723334  0.049143  0.220643  0.256635  0.924405
B  0.724785  0.986360  0.023796  0.005317  0.537640
C  0.032351  0.388365  0.594021  0.771781  0.651114
D  0.525043  0.331240  0.054152  0.575568  0.606084
E  0.313854  0.460321  0.074794  0.384649  0.011486
F  0.721451  0.541979  0.824557  0.054985  0.487314
G  0.927852  0.338191  0.271117  0.804379  0.657553
H  0.962213  0.928274  0.281076  0.240535  0.301883

In [17]:
df1["Score1"]

A    0.723334
B    0.724785
C    0.032351
D    0.525043
E    0.313854
F    0.721451
G    0.927852
H    0.962213
Name: Score1, dtype: float64

In [19]:
df1[["Score1","Score2","Score3"]]

     Score1    Score2    Score3
A  0.723334  0.049143  0.220643
B  0.724785  0.986360  0.023796
C  0.032351  0.388365  0.594021
D  0.525043  0.331240  0.054152
E  0.313854  0.460321  0.074794
F  0.721451  0.541979  0.824557
G  0.927852  0.338191  0.271117
H  0.962213  0.928274  0.281076

In [21]:
df1["Score6"]=df1["Score1"]+df1["Score2"]
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.723334  0.049143  0.220643  0.256635  0.924405  0.772478
B  0.724785  0.986360  0.023796  0.005317  0.537640  1.711144
C  0.032351  0.388365  0.594021  0.771781  0.651114  0.420716
D  0.525043  0.331240  0.054152  0.575568  0.606084  0.856283
E  0.313854  0.460321  0.074794  0.384649  0.011486  0.774175
F  0.721451  0.541979  0.824557  0.054985  0.487314  1.263430
G  0.927852  0.338191  0.271117  0.804379  0.657553  1.266042
H  0.962213  0.928274  0.281076  0.240535  0.301883  1.890487

In [30]:
df2={'ID':['101','102','103','107','176'],'Name':['John','Mercy','Akash','Kavin','Lally'],'Profit':[20,54,56,87,123]}
df=pd.DataFrame(df2)
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [31]:
df["ID"]

0    101
1    102
2    103
3    107
4    176
Name: ID, dtype: object

In [32]:
df[["ID","Name","Profit"]]

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [33]:
df=df.drop("ID",axis=1)

In [34]:
df

    Name  Profit
0   John      20
1  Mercy      54
2  Akash      56
3  Kavin      87
4  Lally     123

In [35]:
df.drop(3)

    Name  Profit
0   John      20
1  Mercy      54
2  Akash      56
4  Lally     123